package messages

// Start
var Hello = "Привет, я могу отложенно опубликовать сообщения в твои телеграм каналы. МНОГО МНОГО ТЕКСТА С ОПИСАНИЕМ И ПРОЧИМ ПРОЧИМ"
var Info = "Описываем правила того как все здесь устроено и работает."

// Common
var Unknown = "Сообщение не распознано. Используй клавиатуру для выбора действия.\n\n"
var CommonError = "Что-то пошло не так.\n\n"

// Base
var EnterBaseState = "Выбери какое действие ты хочешь выполнить."

// ShowMyChannels
var NoChannels = "У тебя еще нет каналов. Можешь добавить нажав на соотвествующую кнопку"
var AllYourChannel = "Количество твоих каналов: %d\n"
var ChannelPage = "Страница %d из %d\n"
var SelectChannel = "Выбери канал:\n"
var ChannelsNotFound = "Что-то пошло не так, каналы не найдены."

// AddChannel
var AddChannel = "Добавь бота в администраторы канала, после чего пришли ссылку на канал или перешли сообщение."
var BotNameNotFound = "Не удалось распознать сообщение. Проверь, что ты выполнил все условия.\n\n"
var BotNotChannelMember = "Не удалось найти бота в администраторах канала. Проверь, что ты выполнил все условия.\n\n"
var BotNotAdmin = "У бота нет необходимых прав администратора в этом канале. Проверь, что ты выполнил все условия.\n\n"
var AddChannelError = "Что-то пошло не так, не получилось добавить канал. Проверь, что ты выполнил все условия.\n\n"

// RemoveChannel
var RemoveChannel = "Удалить канал %s?"
var ChannelNotFound = "Что-то пошло не так, канал не найден."
